# 4 пункт
# однострочный комментарий
'''
Многострочный
комментарий
'''
'''
Пример работы с целыми числами
'''
a = 15
b = 7
print("a = ", a)
print("b = ", b)
print("a + b = ", a + b) # сложение чисел
print("a - b = ", a - b) # вычитание чисел
print("a * b = ", a * b) # умножение чисел
print("a / b = ", a / b) # деление чисел
print("a // b = ", a // b) # деление с округлением вниз до целого
print("a % b = ", a % b)  # остаток от деления
print("a ** b = ", a ** b)  # возведение в степень
# приведение типа int к float
a1 = float(a)
print("a1 = ", a1)
print("\n\n")

'''
Пример работы с вещественными числами
'''
c = 3.5
d = 6.9
print("c = ", c)
print("d = ", d)
print("c + d = ", c + d) # сложение чисел c и d
print("c * d = ", c * d) # умножение чисел c и d
print("c / d = ", c / d) # деление чисел c и d

d1 = 2.3e-5
print("d1 = ", d1)
print("c + d1 = ", c + d1)  # сложение чисел
# приведение типа float к int
d2 = int(d)
print("d2 = ", d2)
print("\n\n")

'''
Операторы присваивания
'''
e = 7
print("e = 7: ", e)
e += 3 # прибавление 3 к числу e
print("e += 3: ", e)
e -= 3 # вычитание 3 из числа e
print("e -= 3: ", e)
e *= 15 # умножение числа e на 15
print("e *= 15: ", e)
e /= 4 # деление числа e на 4
print("e /= 4: ", e)
e //= 2 # деление с округлением вниз до целого числа e на 2
print("e //= 2: ", e)
e %= 5 # остаток от деления числа e на 5
print("e %= 5: ", e)
e **= 3 # возведение числа e в 3 степень
print("e **= 3: ", e)
print("\n\n")

# 5 пункт
'''
Пример работы с целыми числами
'''
a = 14
b = 6
print("a = ", a)
print("b = ", b)
print("a + b = ", a + b)  # сложение чисел
print("a - b = ", a - b)  # вычитание чисел
print("a * b = ", a * b)  # умножение чисел
print("a / b = ", a / b)  # деление чисел
print("a // b = ", a // b)  # деление с округлением вниз до целого
print("a % b = ", a % b)  # остаток от деления
print("a ** b = ", a ** b)  # возведение в степень

# приведение типа int к float
a1 = float(a)
print("a1 = ", a1)
print("\n\n")

# 6 пункт

z = 3
y = 5
print("z = ", z)
print("y = ", y)
print("z + y = ", z + y)  # сложение чисел
print("z - y = ", z - y)  # вычитание чисел
print("z * y = ", z * y)  # умножение чисел
print("z / y = ", z / y)  # деление чисел
print("z // y = ", z // y)  # деление с округлением вниз до целого
print("z % y = ", z % y)  # остаток от деления
print("z ** y = ", z ** y)  # возведение в степень
print("\n\n")

# 7 пункт

x = 105
v = 58
print("x = ", x)
print("v = ", v)
x1 = (x / v)
print("x1 = ", x1)
x1 = float(x1) # приведение типа int к float
print("x1 = ", x1)
print("\n\n")